Repository: hzulla/kano-updater
Catalog: po/*.po
Languages: de

source: Administrator priviledges are required to perform this operation
de: Für diese Aufgabe sind Administrator-Rechte nötig

source: Error
de: Fehler

source: An instance of Kano Updater is already running
de: Kano Updater wird bereits ausgeführt

source: Updating apt sources
de: Hole aktuelle Paketlisten

source: Initialising apt cache
de: Bereite Paket-Cache vor

source: Reading package lists
de: Lese Paketliste

source: Building dependency tree
de: Prüfe Abhängigkeiten zwischen Paketen

source: Reading state information
de: Lese Status-Informationen

source: Building data structures
de: Bereite Datenstrukturen vor

source: Downloading packages
de: Hole Pakete

source: Installing packages
de: Installiere Pakete

source: Cleaning dpkg journal
de: Lösche das Journal von dpkg

source: Fixing broken packages
de: Repariere kaputte Pakete

source: Updating home folders from template
de: Update der Home-Verzeichnisse

source: Refreshing the desktop
de: Bringe Desktop auf den neuesten Stand

source: Expanding filesystem partitions
de: Vergrößere Dateisysteme auf den Partitionen

source: No need to check for updates
de: Keine Update-Prüfung notwendig

source: Time check passed, doing update check!
de: Genügend Zeit vergangen, Update-Prüfung!

source: Not enough time passed for a new update check!
de: Noch nicht ausreichend Zeit vergangen für eine Update-Prüfung!

source: Must have internet to check for updates
de: Für eine Update-Prüfung ist eine Internetverbindung notwendig

source: Could not connect to the download server
de: Keine Verbindung zum Download-Server

source: Checking for updates
de: Suche nach neuen Updates

source: Downloading updates
de: Hole Updates

source: No updates to download
de: Keine Updates zu holen

source: Updates have been downloaded already
de: Alle Updates sind bereits heruntergeladen

source: The download is already running
de: Der Download läuft bereits

source: Updates are already being installed
de: Updates werden bereits installiert

source: Must have internet to download the updates
de: Für den Download der Updates ist eine Internetverbindung notwendig

source: Downloading Python packages
de: Hole Python-Pakete

source: Downloading apt packages
de: Hole apt-Pakete

source: Downloading {}
de: Hole {]

source: The install is already running
de: Die Installation läuft bereits

source: Installing updates
de: Installiere Updates

source: Starting Update
de: Starte Update

source: Updating Itself
de: Update mich selbst

source: Running The Preupdate Scripts
de: Führe die vorbereitenden Skripte aus

source: Updating Pip Packages
de: Update Pip-Pakete

source: Updating Deb Packages
de: Update Deb-Pakete

source: Running The Postupdate Scripts
de: Führe die abschließenden Skripte aus

source: Performing auxiliary tasks
de: Erledige noch dies und das

source: Unfortunately, your version of Kano OS is too old to be updated through the updater.
de: Leider ist Dein Kano OS zu alt, um es mit dem Updater auf den neuesten Stand zu bringen.

source: You will need to download the image of the OS and reflash your SD card.
de: Bitte lade das neueste Image von Kano OS herunter und installiere es mit einer SD-Karte.

source: The updater has been updated, relaunching.
de: Das Update des Updaters ist fertig, starte neu.

source: The pre-update tasks failed.
de: Die vorbereitenden Aufgaben klappten nicht.

source: The post-update tasks failed.
de: Die abschließenden Aufgaben klappten nicht.

source: Installing {}
de: Installiere {}

source: Later
de: Später

source: The action needs to be implemented
de: Diese Aktion ist noch nicht implementiert

source: New Update
de: Neues Update

source: Get new powers
de: Neue Superkräfte

source: Download the latest Kano OS
de: Hole das neueste Kano OS

source: Almost there...
de: Fast fertig...

source: Downloaded and ready to go! In a matter of minutes your Kano will be fresher than ever
de: Download fertig, jetzt geht's los! In ein paar Minuten ist Dein Kano auf dem neuesten Stand

source: Install
de: Installieren

source: The install unexpectantly quit
de: Die Installation ist unerwartet abgebrochen

source: Please try again later
de: Versuch's bitte später noch einmal

source: No updates available
de: Keine Updates vorhanden

source: Your system is already up to date
de: Dein System ist bereits auf dem neuesten Stand

source: Update completed
de: Update abgeschlossen

source: Error updating
de: Fehler bei Update

source: Updater Splash
de: Updater Info

source: In 1978, the fastest computer in the world was the Cray 1 — it cost $7 million and weighed as much as an average elephant! Your Kano is about 4 times faster than the Cray 1. To keep it up to speed, we're downloading new games, apps and projects, and streamlining the computer's memory. This should take about 15 minutes. In the meantime, why not take a phone picture of your Kano? Send it to us at <b>hello@kano.me</b> and we'll share it with the world. You can also search for the white rabbit on <b>http://world.kano.me</b>
de: 1978 war die Cray 1 der schnellste Computer der Welt — sie kostete 7 Millionen US-Dollar und war so schwer wie ein Elefant! Dein Kano ist ca. vier mal so schnell wie die Cray 1. Damit er auf Zack bleibt, optimieren wir jetzt seinen Speicher und laden neue Spiele, Apps und Projekte herunter. Das wird eine gute Viertelstunde dauern. Wie wär's, wenn Du währenddessen ein Foto von Deinem Kano machst? Schick's an <b>hello@kano.me</b> und wir teilen es mit der Welt. Oder komm zu <b>http://world.kano.me</b> und suche das weiße Kaninchen.

source: Computers can learn new ideas quickly. Right now, we're updating the Updater tool. Once this step is finished, the Updater will relaunch. How do computers think? They are made of electrical switches, connected together in clever ways. If a switch is on, that means "yes" or "1"; if it's off, that means "no" or "0". These little yes-no switches become a binary code — for words, sounds, rules, and more. Your computer has over 10 million tiny switches, called transistors, in its brain. In your brain, these switches are cells called neurons. They're talking to each other right now.
de: Computer können schnell neue Ideen lernen. Im Moment aktualisieren wir den Updater. Wenn das erledigt ist wird der Updater neu starten. Wie denken Computer? Sie bestehen aus winzigen elektrischen Schaltern, die in tollen Schaltkreisen miteinander verdrahtet sind. Ist der Schalter an, heißt das "Ja" oder "1", ist er aus, heißt das "Nein" oder "0". Diese kleinen Ja-Nein-Schalter bilden einen binären Code — und daraus werden Wörter, Töne, Regeln und mehr. Die Schalter im Gehirn Deines Computer heißen Transistoren, und es sind über 10 Million drin. Die Schalter in Deinem Gehirn sind Zellen und heißen Neuronen. Jetzt gerade reden sie miteinander.

source: Python is one of the world's most popular programming languages. A programming language takes words that humans can understand, and translates them into instructions that the computer's switches can understand. A good "make a sandwich" program would go through all the steps necessary to get the sandwich made, from "grab bread" to "pick up knife" to "put it on a plate." The computer follows a program in Python the way a cook follows a recipe in English. Python code can build volcanos in Minecraft, grab "Gangnam Style" from YouTube, and move millions of dollars in the New York Stock Exchange.
de: Python ist eine der beliebtesten Programmiersprachen der Welt. Eine Programmiersprache übersetzt Wörter, die ein Mensch verstehen kann, in Anweisungen, welche die Schalter des Computers verstehen. Ein gut durchdachtes "Mach mir ein Sandwich"-Programm würde alle Schritte für die Sandwich-Zubereitung beschreiben, von "hole eine Scheibe Brot" über "nimm das Messer" bis "leg's auf den Teller". Ein Computer befolgt ein Python-Programm so, wie ein Koch ein Rezept befolgt. Python-Code kann Vulkane in Minecraft bauen, "Gangnam Style" von Youtube ziehen und Millionen US-Dollar an der New Yorker Börse bewegen.

source: The name "Kano" comes from Kanō Jigorō. He was a Japanese schoolteacher, inventor of the art of judo. His motto: Maximum efficiency, minimum effort. In Greek, Kano means "I make". (Kano is also the largest city in Northern Nigeria.) What makes Kano different to other computers? All of the ideas in its brain are open for you to see. Just visit <b>github.com/KanoComputing</b> to see the code. Kano can also change forms… You can turn it into a robot, server, radio, and more. Visit <b>world.kano.me/projects</b> for powerup ideas. Want a look inside Kano HQ? Hang with our wizards at <b>blog.kano.me</b>
de: Dein Computer heißt "Kano" - nach Kanō Jigorō. Der japanische Lehrer ist der Erfinder der Kampfkunst Judo. Sein Prinzip: Maximale Wirkung bei einem Minimum an Aufwand. Das griechische Verb Kano heißt "ich mache". (Und Kano heißt auch die größte Stadt im Norden Nigerias.) Was unterscheidet Deinen Kano von anderen Computern? Du kannst Dir alles ansehen, was in seinem Gehirn passiert. Auf <b>github.com/KanoComputing</b> findest Du den Code. Dein Kano kann seine Form verändern… Du kannst aus ihm einen Roboter, einen Server, ein Radio und vieles mehr machen. Einige Ideen dafür findest Du auf <b>world.kano.me/projects</b>. Und auf <b>blog.kano.me</b> lernst Du die Leute hinter Kano kennen.

source: Kano OS is an operating system, which means it connects all the programs together. This OS is based on Linux, whose code is open — that means that it's free for anyone to download, change or even sell. Its code is written by hobbyists and makers worldwide, not just professionals. Kano uses Debian, a fun and powerful "distribution" of Linux which the International Space Station also uses to run its robotic systems — to keep the astronauts from losing their lunch!
de: Kano OS ist ein Betriebssystem. Das heißt, es stellt Dir alle nötigen Programme startklar zu Verfügung. Es basiert auf Linux. Linux ist Open Source Software — es ist kostenlos und jeder kann es herunterladen, verändern und sogar verkaufen. Der Linux-Code wird von Bastlern weltweit geschrieben, nicht nur von Profis. Kano verwendet Debian, eine tolle und beliebte Linux-"Distribution", die z.B. auf der Internationale Raumstation ISS die Robotersysteme steuert, damit die Astronauten ihr Essen nicht verlieren!

source: We're almost done! With your Kano computer, you'll make awesome games, code your own music, stream videos around your house, tell stories, and much more. Your computer is open, and its powers are at your command. If you want to get new cool projects from us each week, join the community at
de: Gleich sind wir fertig! Mit Deinem Kano-Computer wirst Du großartige Spiele, Programme, Deine eigene Musik machen. Du kannst Videos im Haus streamen, Geschichten erzählen und noch viel mehr. Dein Computer ist offen und er steht Dir zur Verfügung. Wenn Du coole neue Projekte von uns kriegen willst, schau doch mal rein unter

source: Your Kano will now reboot! See you in a while…
de: Dein Kano-Computer wird jetzt neu starten! Bis gleich…

source: Time flies — {}% already!
de: Es geht voran — {}% erledigt!

source: Relaunching the Updater
de: Neustart des Updaters

source: The Updater updated itself and is now starting again.
de: Der Updater hat sich selbst aktualisiert und startet jetzt neu

source: Update complete!
de: Update abgeschlossen!

source: Your Kano is up to date and will automatically restart in 10 seconds
de: Dein Kano ist auf dem neuesten Stand und wird in 10 Sekunden automatisch neu starten

source: Press ENTER to restart now
de: Drücke ENTER für sofortigen Neustart

source: We had a problem with the Update. Make sure you are connected to the Internet, and give it another go. If you still have problems, we can help at http://help.kano.me
de: Beim Update gab es ein Problem. Bitte prüfe die Internet-Verbindung und versuche es noch einmal. Falls Du nicht weiterkommst, können wir Dir bei http://help.kano.me helfen.

source: Update error
de: Update-Fehler

source: Error!
de: Fehler!

source: kano-updater must be executed with root privileges
de: kano-updater benötigt Root-Rechte

source: Download updates
de: Hole Updates

source: Download in progress ...
de: Download läuft...

source: Install updates
de: Installiere Updates

source: Installation in progress ...
de: Installation läuft...

source: No updates found
de: Keine Updates gefunden

source: Check again
de: Nochmal prüfen

source: A reminder to keep your Kano OS up-to-date.
de: Hält Kano OS auf dem neuesten Stand.
